Repository: cnhuya/ContractGenerator
Catalog: ContractGenerator/Properties/Resources.*.resx
Languages: cs_cz, ko_kr

# tokenName
source: Name
cs_cz: Název
ko_kr: 이름

source: Variable Name
cs_cz: Název proměnné
ko_kr: 변수 이름

# advancedInfo
source: More advanced and scalable smart contract that handles the store of historical/previously stored data. Example usage: Storing ALL existing orders of something…
cs_cz: Pokročilejší a škálovatelný chytrý kontrakt, který ukládá historická/předchozí data. Příklad použití: Ukládání všech existujících objednávek něčeho…
ko_kr: 더 발전되고 확장 가능한 스마트 계약으로, 과거 데이터를 저장할 수 있습니다. 사용 예시: 모든 기존 주문 저장…

# tokenburnFee
source: Burn Fee
cs_cz: Spalovací poplatek
ko_kr: 소각 수수료

# tokenPrivileges
source: Owner Privileges
cs_cz: Vlastnická práva
ko_kr: 소유자 권한

# tokenFee
source: Fees
cs_cz: Poplatek
ko_kr: 수수료

# tokenMintable
source: Mintable
cs_cz: Ražitelné
ko_kr: 민팅 가능

# tokenfeeInfo
source: Set to 0, if you don’t want any fees.
cs_cz: Nastavte na 0, pokud nechcete žádné poplatky.
ko_kr: 수수료를 원하지 않으면 0으로 설정하세요.

# tokenSymbol
source: Symbol
ko_kr: 심볼

# tokentxFee
source: Transfer Fee
cs_cz: Převodní poplatek
ko_kr: 전송 수수료

# tokenstakingInfoa
source: Set to 0, if you don’t want a staking function.
cs_cz: Nastavte na 0, pokud nechcete funkci stakingu.
ko_kr: 스테이킹 기능을 원하지 않으면 0으로 설정하세요.

# deluxeInfo
source: Highly scalable, capable, and customizable smart contract, which can store multiple values for a certain data structure.
cs_cz: Vysoce škálovatelný, výkonný a přizpůsobitelný chytrý kontrakt, který může ukládat více hodnot pro určitou datovou strukturu. Příklad použití: Ukládání historických nákupů pro každého uživatele.
ko_kr: 확장성이 뛰어나고 강력하며 사용자 정의가 가능한 스마트 계약으로, 특정 데이터 구조에 사용 예시: 각 사용자의 구매 이력 저장.

# simpleInfo
source: Simple yet highly customizable smart contract that handles storing either permanent or temporary data, doesn’t save historical data. Example usage: Your Own Profile (Storing Name, Age, Gender).
cs_cz: Jednoduchý, ale vysoce přizpůsobitelný chytrý kontrakt, který ukládá trvalá nebo dočasná data, ale neukládá historická data. Příklad použití: Váš vlastní profil (ukládání jména, věku, pohlaví).
ko_kr: 간단하지만 높은 사용자 정의가 가능한 스마트 계약으로, 영구적이거나 임시 데이터를 저장할 수 있으며, 역사적 데이터를 저장하지 않습니다. 사용 예시: 나만의 프로필 (이름, 나이, 성별 저장).

# tokenSupply
source: Supply
cs_cz: Nabídka
ko_kr: 공급량

# tokenBurnable
source: Burnable
cs_cz: Spalitelné
ko_kr: 소각 가능

# cryptoInfo
source: Create your own cryptocurrency. You can set how many coins should exist, the name, ticker, and also implement special functions such as inflation, or halving like Bitcoin does!
cs_cz: Vytvořte si vlastní kryptoměnu. Můžete nastavit počet mincí, které budou existovat, název, ticker a implementovat speciální funkce, jako je inflace nebo půlení, jako to dělá Bitcoin!
ko_kr: 나만의 암호화폐를 만들어보세요. 존재해야 할 코인의 수, 이름, 티커를 설정하고, 인플레이션이나 비트코인처럼 반감기 기능도 구현할 수 있습니다!

# tokenStaking
source: Staking
ko_kr: 스테이킹

# dataStorageInfo
source: Create your own specialized smart contracts which allow storing any type of data you desire on Move & Solidity-compatible blockchains.
cs_cz: Vytvořte si vlastní specializované chytré kontrakty, které umožňují ukládání jakéhokoli typu dat na blockchainech kompatibilních s Move & Solidity.
ko_kr: 나만의 특수 스마트 계약을 만들어 Move 및 Solidity 호환 블록체인에서 원하는 모든 유형의 데이터를 저장할 수 있습니다.

source: Variable Type
cs_cz: Typ proměnné
ko_kr: 변수 유형

# tokenDecimals
source: Decimals
cs_cz: Desetinná místa
ko_kr: 소수점 자리수

# tokenGenerate
source: Generate
cs_cz: Generovat
ko_kr: 생성

# String1
source: Select
cs_cz: Vybrat
ko_kr: 선택

source: Add Variable
cs_cz: Přidat proměnnou
ko_kr: 변수 추가

source: Delete Variable
cs_cz: Smazat proměnnou
ko_kr: 변수 삭제

source: Continue
cs_cz: Pokračovat
ko_kr: 계속하기

source: Fee Collector
cs_cz: Výběrce poplatků
ko_kr: 수수료 징수자

source: Package
cs_cz: Balíček
ko_kr: 소포

source: Code
cs_cz: Kód
ko_kr: 코드

source: View Variables
cs_cz: Zobrazit proměnné
